socialNetwork/jaeger_traces/limit_socnetapp_user-mention-service/traces_0.3.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 5.577ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.879ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.524ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.279ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.290ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.256ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.331ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.461ms, rate sampling interval: 13ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.94ms    0.85ms   7.11ms   87.28%
    Req/Sec    25.36     45.72   181.00     73.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.78ms
 75.000%    5.20ms
 90.000%    5.76ms
 99.000%    7.11ms
 99.900%   15.72ms
 99.990%   22.00ms
 99.999%   22.00ms
100.000%   22.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.711     0.000000            1         1.00
       4.263     0.100000          395         1.11
       4.415     0.200000          783         1.25
       4.543     0.300000         1180         1.43
       4.663     0.400000         1563         1.67
       4.779     0.500000         1951         2.00
       4.851     0.550000         2151         2.22
       4.919     0.600000         2343         2.50
       4.999     0.650000         2540         2.86
       5.087     0.700000         2732         3.33
       5.199     0.750000         2933         4.00
       5.251     0.775000         3026         4.44
       5.335     0.800000         3123         5.00
       5.411     0.825000         3218         5.71
       5.507     0.850000         3316         6.67
       5.619     0.875000         3415         8.00
       5.699     0.887500         3464         8.89
       5.755     0.900000         3510        10.00
       5.851     0.912500         3559        11.43
       5.931     0.925000         3612        13.33
       6.039     0.937500         3657        16.00
       6.095     0.943750         3681        17.78
       6.167     0.950000         3705        20.00
       6.255     0.956250         3730        22.86
       6.359     0.962500         3754        26.67
       6.467     0.968750         3779        32.00
       6.539     0.971875         3791        35.56
       6.639     0.975000         3803        40.00
       6.679     0.978125         3816        45.71
       6.735     0.981250         3827        53.33
       6.863     0.984375         3840        64.00
       6.923     0.985938         3846        71.11
       7.007     0.987500         3852        80.00
       7.059     0.989062         3858        91.43
       7.155     0.990625         3864       106.67
       7.283     0.992188         3870       128.00
       7.527     0.992969         3873       142.22
       7.707     0.993750         3876       160.00
       7.855     0.994531         3879       182.86
       8.067     0.995313         3882       213.33
       9.031     0.996094         3885       256.00
      10.175     0.996484         3887       284.44
      10.943     0.996875         3888       320.00
      11.599     0.997266         3890       365.71
      12.007     0.997656         3891       426.67
      12.975     0.998047         3893       512.00
      13.599     0.998242         3894       568.89
      13.599     0.998437         3894       640.00
      15.327     0.998633         3895       731.43
      15.719     0.998828         3896       853.33
      16.095     0.999023         3897      1024.00
      16.095     0.999121         3897      1137.78
      16.095     0.999219         3897      1280.00
      16.295     0.999316         3898      1462.86
      16.295     0.999414         3898      1706.67
      16.863     0.999512         3899      2048.00
      16.863     0.999561         3899      2275.56
      16.863     0.999609         3899      2560.00
      16.863     0.999658         3899      2925.71
      16.863     0.999707         3899      3413.33
      21.999     0.999756         3900      4096.00
      21.999     1.000000         3900          inf
#[Mean    =        4.942, StdDeviation   =        0.855]
#[Max     =       21.984, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5852 requests in 30.02s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9495
Requests/sec:    194.94  
Transfer/sec:     40.93KB