socialNetwork/jaeger_traces/limit_socnetapp_user-mention-service/traces_0.5.log
Running 30s test @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 14.148ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 13.488ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 13.594ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 14.152ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 13.632ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.724ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 13.222ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 13.692ms, rate sampling interval: 40ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.97ms    4.73ms  30.72ms   73.06%
    Req/Sec    24.63     25.08   102.00     81.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.13ms
 75.000%   17.52ms
 90.000%   20.94ms
 99.000%   30.72ms
 99.900%   38.30ms
 99.990%   55.90ms
 99.999%   55.90ms
100.000%   55.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.627     0.000000            1         1.00
       9.959     0.100000          392         1.11
      10.943     0.200000          785         1.25
      11.879     0.300000         1173         1.43
      12.903     0.400000         1561         1.67
      14.127     0.500000         1954         2.00
      14.727     0.550000         2149         2.22
      15.335     0.600000         2341         2.50
      15.959     0.650000         2536         2.86
      16.751     0.700000         2732         3.33
      17.519     0.750000         2926         4.00
      18.095     0.775000         3030         4.44
      18.463     0.800000         3123         5.00
      18.959     0.825000         3219         5.71
      19.535     0.850000         3318         6.67
      20.095     0.875000         3414         8.00
      20.431     0.887500         3464         8.89
      20.943     0.900000         3511        10.00
      21.519     0.912500         3560        11.43
      22.335     0.925000         3610        13.33
      22.991     0.937500         3658        16.00
      23.375     0.943750         3682        17.78
      23.839     0.950000         3706        20.00
      24.303     0.956250         3732        22.86
      24.815     0.962500         3755        26.67
      25.615     0.968750         3780        32.00
      26.063     0.971875         3793        35.56
      26.351     0.975000         3804        40.00
      27.007     0.978125         3816        45.71
      27.599     0.981250         3829        53.33
      28.271     0.984375         3841        64.00
      28.671     0.985938         3847        71.11
      29.119     0.987500         3853        80.00
      30.463     0.989062         3859        91.43
      30.863     0.990625         3865       106.67
      31.567     0.992188         3871       128.00
      32.143     0.992969         3874       142.22
      32.367     0.993750         3877       160.00
      32.751     0.994531         3880       182.86
      33.343     0.995313         3883       213.33
      33.663     0.996094         3886       256.00
      34.079     0.996484         3888       284.44
      34.111     0.996875         3889       320.00
      34.591     0.997266         3891       365.71
      34.687     0.997656         3892       426.67
      35.967     0.998047         3894       512.00
      36.991     0.998242         3895       568.89
      36.991     0.998437         3895       640.00
      37.695     0.998633         3896       731.43
      38.303     0.998828         3897       853.33
      39.455     0.999023         3898      1024.00
      39.455     0.999121         3898      1137.78
      39.455     0.999219         3898      1280.00
      40.543     0.999316         3899      1462.86
      40.543     0.999414         3899      1706.67
      40.575     0.999512         3900      2048.00
      40.575     0.999561         3900      2275.56
      40.575     0.999609         3900      2560.00
      40.575     0.999658         3900      2925.71
      40.575     0.999707         3900      3413.33
      55.903     0.999756         3901      4096.00
      55.903     1.000000         3901          inf
#[Mean    =       14.975, StdDeviation   =        4.728]
#[Max     =       55.872, Total count    =         3901]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5872 requests in 30.13s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9541
Requests/sec:    194.89  
Transfer/sec:     40.92KB