socialNetwork/jaeger_traces/limit_socnetapp_user-mention-service/traces_socnetapp_user-mention-service_0.5.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 5.123ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.038ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.836ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.798ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.855ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.526ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.784ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.849ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.60ms  618.01us   6.50ms   75.33%
    Req/Sec    25.50     48.93   200.00     75.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.49ms
 75.000%    4.88ms
 90.000%    5.41ms
 99.000%    6.50ms
 99.900%    8.77ms
 99.990%   12.43ms
 99.999%   12.43ms
100.000%   12.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.353     0.000000            1         1.00
       3.963     0.100000          390         1.11
       4.115     0.200000          786         1.25
       4.239     0.300000         1173         1.43
       4.363     0.400000         1569         1.67
       4.487     0.500000         1948         2.00
       4.551     0.550000         2148         2.22
       4.615     0.600000         2340         2.50
       4.695     0.650000         2535         2.86
       4.779     0.700000         2736         3.33
       4.875     0.750000         2923         4.00
       4.939     0.775000         3027         4.44
       4.991     0.800000         3119         5.00
       5.071     0.825000         3219         5.71
       5.163     0.850000         3315         6.67
       5.275     0.875000         3409         8.00
       5.343     0.887500         3458         8.89
       5.407     0.900000         3513        10.00
       5.467     0.912500         3557        11.43
       5.547     0.925000         3606        13.33
       5.627     0.937500         3653        16.00
       5.687     0.943750         3678        17.78
       5.767     0.950000         3703        20.00
       5.855     0.956250         3727        22.86
       5.915     0.962500         3750        26.67
       6.003     0.968750         3775        32.00
       6.051     0.971875         3787        35.56
       6.107     0.975000         3799        40.00
       6.159     0.978125         3811        45.71
       6.227     0.981250         3823        53.33
       6.303     0.984375         3836        64.00
       6.363     0.985938         3842        71.11
       6.427     0.987500         3848        80.00
       6.483     0.989062         3854        91.43
       6.519     0.990625         3860       106.67
       6.591     0.992188         3866       128.00
       6.663     0.992969         3869       142.22
       6.719     0.993750         3872       160.00
       6.755     0.994531         3875       182.86
       6.839     0.995313         3878       213.33
       6.947     0.996094         3881       256.00
       7.003     0.996484         3883       284.44
       7.015     0.996875         3884       320.00
       7.051     0.997266         3886       365.71
       7.071     0.997656         3887       426.67
       7.251     0.998047         3889       512.00
       7.447     0.998242         3890       568.89
       7.447     0.998437         3890       640.00
       7.663     0.998633         3891       731.43
       8.767     0.998828         3892       853.33
       8.823     0.999023         3893      1024.00
       8.823     0.999121         3893      1137.78
       8.823     0.999219         3893      1280.00
       8.879     0.999316         3894      1462.86
       8.879     0.999414         3894      1706.67
      10.111     0.999512         3895      2048.00
      10.111     0.999561         3895      2275.56
      10.111     0.999609         3895      2560.00
      10.111     0.999658         3895      2925.71
      10.111     0.999707         3895      3413.33
      12.431     0.999756         3896      4096.00
      12.431     1.000000         3896          inf
#[Mean    =        4.598, StdDeviation   =        0.618]
#[Max     =       12.424, Total count    =         3896]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5828 requests in 30.10s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9507
  Non-2xx or 3xx responses: 4
Requests/sec:    193.64  
Transfer/sec:     40.66KB